//switch используется как заменитель if else

// const alex = 4;

// switch (alex) {
//   case 1:
//     console.log("Вы плохо подготовились!");
//     break;
//   case 2:
//     console.log("Неудовлетворительно!");
//     break;
//   case 3:
//     console.log("Можно было и лучше!");
//     break;
//   case 4:
//     console.log("Хорошо, постарался!");
//     break;
//   case 5:
//     console.log("Молодец! Отлично!");
//     break;
//   default:
//     console.log("Такой оценки не существует!");
// }

//==========Масивы=============================

// const fruit1 = "Яблоко";
// const fruit2 = "Груша";
// const fruit3 = "Слива";
// const fruit4 = "Апельсин";

// console.log(fruit3);
//-------------------------

// const fruits = ["Яблоко" + "Груша" + "Слива" + "Апельсин"];
// console.log(fruits);

// console.log(fruits[1]);

//=====Цикл Фор - позволяет запускать код несколько раз====

// for (let i = 0; i < 10; i++) {
//   console.log("Hello world!");
// }

// for (let i = 0; i < 10; i++) {
//   console.log("i =" + i);
// }

const fruits = [
  "Яблоко",
  "Груша",
  "Слива",
  "Апельсин",
  "Яблоко1",
  "Груша2",
  "Слива3",
  "Апельсин4",
  "Яблоко11",
  "Груша22",
  "Слива33",
  "Апельсин44",
];
for (let i = 0; i < 12; i++) {
  console.log(fruits[i]);
}

const fruits = [
  "Яблоко",
  "Груша",
  "Слива",
  "Апельсин",
  "Яблоко1",
  "Груша2",
  "Слива3",
  "Апельсин4",
  "Яблоко11",
  "Груша22",
  "Слива33",
  "Апельсин44",
];

console.log(fruits.length);

const fruits = [
  "Яблоко",
  "Груша",
  "Слива",
  "Апельсин",
  "Яблоко1",
  "Груша2",
  "Слива3",
  "Апельсин4",
  "Яблоко11",
  "Груша22",
  "Слива33",
  "Апельсин44",
];
for (let i = 0; i < fruits.length; i++) {
  console.log(fruits[i]);
}

// продолжение1.59
